#include <iostream>
using namespace std;

void func_Proc1()
{
	//Дан номер дня – целое число от 1 до 31 
	//и месяца — целое число в диапазоне 1–12(1 — январь, 2 — февраль и т.д.). 
	//Вывести дату в виде текста(например, «пятое января»).

	//0-11
	string m_Name[] = { "января", "февраля", "марта", "апреля", "мая",
		"июня", "июля", "августа", "сентября", "октября", "ноября", "декабря" };

	string day_ord[] = { "тридцатое", "первое", "второе", "третье",
		"четвертое", "пятое", "шестое", "седьмое", "восьмое",
		"девятое", "десятое", "одиннадцатое", "двенадцатое", "тринадцатое", "четырнадцатое",
		"пятнадцатое", "шестнадцатое", "семнадцатое", "восемнадцатое",
		"девятнадцатое",
		"двадцатое" };

	int A, B;
	string m;

	cout << "номер дня – целое число от 1 до 31:  ";
	cin >> A;
	cout << "\n";

	cout << "месяц — целое число в диапазоне 1–12(1 — январь, 2 — февраль и т.д.):  ";
	cin >> B;
	cout << "\n";

	m = m_Name[B - 1]; //месяц

	if (A == 30)
	{
		cout << day_ord[0] << " " << m;
	}
	if (A == 31)
	{
		cout << "тридцать " << day_ord[1] << " " << m;
	}

	if (A >= 1 && A <= 20)
	{
		cout << day_ord[A] << " " << m;
	}

	if (A >= 21 && A <= 29)
	{
		cout << "двадцать " << day_ord[A - 20] << " " << m;
	}
}

void func_Proc2()
{
	//Робот может перемещаться в четырех направлениях
	// («С» — север, «З» — запад, «Ю» — юг, «В» — восток) 
	// и принимать три цифровые команды : 
	// 0 — продолжать движение, 1 — поворот налево, −1 — поворот направо.
	// Дан символ C — исходное направление робота и целое число N — посланная ему команда.
	// Вывести направление робота после выполнения полученной команды
	string  C;
	int N;

	string np;
	string cmd;

	string m_C[] = { "север", "запад", "юг", "восток" };
	string m_N[] = { "продолжать движение", "поворот налево", "поворот направо" };

	cout << "направление («N» — север, «W» — запад, «S» — юг, «E» — восток):  ";
	cin >> C;
	cout << "\n";

	cout << "команда (0 — продолжать движение, 1 — поворот налево, −1 — поворот направо):  ";
	cin >> N;
	cout << "\n";

	switch (N)
	{
	case 0:
		cmd = m_N[0];
		break;
	case 1:
		cmd = m_N[1];
		break;
	case -1:
		cmd = m_N[2];
		break;
	default:
		break;
	}
	if (C == "N")
	{
		np = m_C[0];
	}
	else if (C == "W")
	{
		np = m_C[1];
	}
	else if (C == "S")
	{
		np = m_C[2];
	}
	else if (C == "E")
	{
		np = m_C[3];
	}
	// Вывести направление робота после выполнения полученной команд
	cout << "направление на " << np << " ; команда " << cmd;
}

void func_Proc3()
{
	//Дано целое число в диапазоне 10–40, определяющее количество учебных заданий по некоторой теме.
	// Вывести строку - описание указанного количества заданий, 
	// обеспечив правильное согласование числа со словами «учебное задание», 
	// например: 18 — «восемнадцать учебных заданий».

	string m_dec[] = { "десять","двадцать", "тридцать","сорок" };

	string m_dd[] = { "одиннадцать","двенадцать", "тринадцать", "четырнадцать","пятнадцать", "шестнадцать",
		"семнадцать", "восемнадцать","девятнадцать" };

	string m_ed[] = { "один", "два", "три","четыре", "пять", "шесть", "семь", "восемь","девять" };
	string m_od[] = { "одно", "два", "три","четыре", "пять", "шесть", "семь", "восемь","девять" };

	int A;
	cout << "целое число в диапазоне 10–40:  ";
	cin >> A;
	cout << "\n";

	if (A == 10 || A == 20 || A == 30 || A == 40)
	{
		cout << m_dec[(A / 10) - 1] << " учебных заданий";
	}

	if (A > 0 && A < 10)
	{
		switch (A - 1)
		{
		case 0:
			cout << m_od[A - 1] << " учебное задание";
			break;
		case 1:
		case 2:
		case 3:
			cout << m_od[A - 1] << " учебных задания";
			break;
		case 4:
		case 5:
		case 6:
		case 7:
		case 8:
			cout << m_od[A - 1] << " учебных заданий";
			break;
		default:
			break;
		}
	}

	if (A > 10 && A < 20)
	{
		cout << m_dd[(A - 11)] << " учебных заданий";
	}

	if (A > 20 && A < 30)
	{
		switch (A - 21)
		{
		case 0:
			cout << m_dec[(A / 10) - 1] << " " << m_od[A - 21] << " учебное задание";
			break;
		case 1:
		case 2:
		case 3:
			cout << m_dec[(A / 10) - 1] << " " << m_od[A - 21] << " учебных задания";
			break;
		case 4:
		case 5:
		case 6:
		case 7:
		case 8:
			cout << m_dec[(A / 10) - 1] << " " << m_od[A - 21] << " учебных заданий";
			break;
		default:
			break;
		}
	}

	if (A > 30 && A < 40)
	{
		switch (A - 31)
		{
		case 0:
			cout << m_dec[(A / 10) - 1] << " " << m_od[A - 31] << " учебное задание";
			break;
		case 1:
		case 2:
		case 3:
			cout << m_dec[(A / 10) - 1] << " " << m_od[A - 31] << " учебных задания";
			break;
		case 4:
		case 5:
		case 6:
		case 7:
		case 8:
			cout << m_dec[(A / 10) - 1] << " " << m_od[A - 31] << " учебных заданий";
			break;
		default:
			break;
		}
	}

}

void func_Proc4()
{
	//Дано целое число в диапазоне 100–999.
	//Вывести строку - описание данного числа, например: 
	//256 — «двести пятьдесят шесть», 814 — «восемьсот четырнадцать».

	int n;
	cout << "Число: ";
	cin >> n;
	cout << "\n";

	switch (n / 100) {
	case 1:
		cout << "сто ";
		break;
	case 2:
		cout << "двести ";
		break;
	case 3:
		cout << "триста ";
		break;
	case 4:
		cout << "четыреста ";
		break;
	case 5:
		cout << "пятьсот ";
		break;
	case 6:
		cout << "шестьсот ";
		break;
	case 7:
		cout << "семьсот ";
		break;
	case 8:
		cout << "восемьсот  ";
		break;
	case 9:
		cout << "девятьсот  ";
		break;
	}

	if ((n % 100) / 10 == 1)
		switch (n % 100) {
		case 10:
			cout << "десять";
			break;
		case 11:
			cout << "одинадцать";
			break;
		case 12:
			cout << "двенадцать";
			break;
		case 13:
			cout << "тринадцать";
			break;
		case 14:
			cout << "четырнадцать";
			break;
		case 15:
			cout << "пятнадцать";
			break;
		case 16:
			cout << "шестнадцать";
			break;
		case 17:
			cout << "семнадцать";
			break;
		case 18:
			cout << "восемнадцать";
			break;
		case 19:
			cout << "девятнадцать";
			break;
		}
	else {
		switch ((n % 100) / 10) {
		case 2:
			cout << "двадцать ";
			break;
		case 3:
			cout << "тридцать ";
			break;
		case 4:
			cout << "сорок ";
			break;
		case 5:
			cout << "пятьдесят ";
			break;
		case 6:
			cout << "шестьдесят ";
			break;
		case 7:
			cout << "семьдесят ";
			break;
		case 8:
			cout << "восемьдесят ";
			break;
		case 9:
			cout << "девяносто ";
			break;
		}

		switch (n % 10) {
		case 1:
			cout << "один";
			break;
		case 2:
			cout << "два";
			break;
		case 3:
			cout << "три";
			break;
		case 4:
			cout << "четыре";
			break;
		case 5:
			cout << "пять";
			break;
		case 6:
			cout << "шесть";
			break;
		case 7:
			cout << "семь";
			break;
		case 8:
			cout << "восемь";
			break;
		case 9:
			cout << "девять";
			break;
		}
	}

	cout << "\n";
}

void func_Proc5()
{
	//В восточном календаре принят 60 - летний цикл, состоящий из 12 - летних подциклов, обозначаемых названиями 
	//цвета : зеленый, красный, желтый, белый и черный.
	//В каждом подцикле годы носят названия животных : крысы, коровы, тигра, зайца, дракона, змеи, лошади, овцы, 
	//обезьяны, курицы, собаки и свиньи.По номеру года определить его название, если 1984 год — начало цикла : «год зеленой крысы».

	int n;
	cout << "ВВОД Года: ";
	cin >> n;
	cout << "\n";

	cout << "Год ";

	switch ((n) % 10)
	{
	case 0:
	case 1:
		cout << "бел";
		break;
	case 2:
	case 3:
		cout << "черн";
		break;
	case 4:
	case 5:
		cout << "зелён";
		break;
	case 6:
	case 7:
		cout << "красн";
		break;
	case 8:
	case 9:
		cout << "жёлт";
		break;
	}

	switch ((n + 1) % 5)
	{
	case 0:
	case 1:
	case 2:
	case 3:
	case 4:
	case 5:
	case 9:
	case 10:
	case 11:
		cout << "ой ";
		break;
	case 6:
	case 7:
	case 8:
		cout << "ого ";
		break;
	}

	switch ((n + 8) % 12) 
	{
	case 0:
		cout << "крысы";
		break;
	case 1:
		cout << "коровы";
		break;
	case 2:
		cout << "тигра";
		break;
	case 3:
		cout << "зайца";
		break;
	case 4:
		cout << "дракона";
		break;
	case 5:
		cout << "змеи";
		break;
	case 6:
		cout << "лошади";
		break;
	case 7:
		cout << "овцы";
		break;
	case 8:
		cout << "обезьяны";
		break;
	case 9:
		cout << "курицы";
		break;
	case 10:
		cout << "собаки";
		break;
	case 11:
		cout << "свиньи";
		break;
	}
	cout << "\n";
}



int main()
{

	setlocale(LC_ALL, "Rus");
	//func_Proc1();
	//func_Proc2();
	//func_Proc3();
	//func_Proc4();
	func_Proc5();
}

